	NOLIST
;==============================================================================
; Arcadia 2001 - arcadia_define.h
 ; By Jun-ichiro Noguchi - hamaoka.nanao @ gmail.com
 ; Version 0.1 - September 20, 2022
 ; Signetics 2650 source-code for the Arcadia 2001 console.
 ; This file assembles well under VACS v1.24/w32 
 ; (by W.H. Taphoorn; updated by D.D. Spreen)
;==============================================================================
	LIST
 ;2650 Equates
 z	EQU	0
 eq	EQU	z
 p	EQU	1
 gt	EQU	p
 n	EQU	2
 lt	EQU	n
 un	EQU	3

	NOLIST
;==========================================================
; BGCOLOUR:bit6 方向キー読み込み方向
 ; if ((BGCOLOUR & PAD_MASK) == PAD_H){水平方向}
;==========================================================
	LIST
 PAD_MASK	EQU	01000000b
 PAD_H	EQU	01000000b
 PAD_V	EQU	00000000b

	NOLIST
;==========================================================
; BGCOLOUR:タイルカラーセット
;==========================================================
	LIST
 CSET_MASK	EQU	00111000b	; bit5...3
 CSET_A	EQU	00000000b	; WHITE,CYAN,MAGENTA,BLUE
 CSET_B	EQU	00001000b	; YELLOW,GREEN,RED,BLACK

	NOLIST
;==========================================================
;SCRUPDATA,SCRLODATA:タイルカラー。
;==========================================================
	LIST
 BG_CNUM_MASK	EQU	11000000b	; BG タイルカラー部
 BG_CODE_MASK	EQU	00111111b	; BG コード部
 CNUM_0	EQU	00000000b	; CSET_A:WHITE / CSET_B:YELLOW
 CNUM_1	EQU	01000000b	; CSET_A:CYAN  / CSET_B:GREEN
 CNUM_2	EQU	10000000b	; CSET_A:MAGENTA / CSET_B:RED
 CNUM_3	EQU	11000000b	; CSET_A:BLUE / CSET_B:BLACK

	NOLIST
;==========================================================
; BGCOLOUR:背景色、スプライトカラー
;==========================================================
	LIST
 BLACK	EQU	00000111b	; (GRB = 000)
 BLUE	EQU	00000110b	; (GRB = 001)
 RED	EQU	00000101b	; (GRB = 010)
 MAGENTA	EQU	00000100b	; (GRB = 011)
 GREEN	EQU	00000011b	; (GRB = 100)
 CYAN	EQU	00000010b	; (GRB = 101)
 YELLOW	EQU	00000001b	; (GRB = 110)
 WHITE	EQU	00000000b	; (GRB = 111)

	NOLIST
;==========================================================
; PSW(PSU,PSL)bit定義
 ;PSU_S	EQU	10000000b
 ; センス。0=描画中、1=垂直帰線期間
 ;
 ;PSU_F	EQU	01000000b	
 ; フラグ。
 ;
 ;PSU_II	EQU	00100000b
 ; 割り込み禁止。1=割り込み禁止。
 ;
 ;PSU_SP	EQU	00000111b
 ; スタックポインタ。8階層まで(0-7)。内容はRASに記録。
 ;
 ;PSL_CC	EQU	11000000b
 ;コンディションコード。数の正負と0を示す。
 ;	レジスタにロードした時、演算でレジスタの値が変わった時、比較命令を行った時に変化する。
 ;	比較命令ではPSL_COMの設定により値の扱いが変わる。
 ;
 ;PSL_IDC	EQU	00100000b
 ; インターデジットキャリー。BCD(2進化10進数)の演算に使う。
 ;
 ;PSL_RS	EQU	00010000b
 ; レジスタバンクセレクト。使うレジスタを0=表、1=裏で切替。
 ;	PSL_RS=0 表(r0,r1,r2,r3)、
 ;	PSL_RS=1 裏(r0,r4,r5,r6)r4⇔r1、r5⇔r2、r6⇔r3扱い
 ;	設計意図としては割り込み処理前のレジスタ内容保持。でも、まあ、自由に使える。
 ;
 ;PSL_WC	EQU	00001000b
 ; ウィズキャリー。PSL_WC=0の時は対象の8ビットのみ、
 ;	PSL_WC=1の時は対象の8ビット+PSL_Cの9ビットで処理をする。
 ;	16ビット以上の加算や減算時、PSL_Cの準備と共に設定し、下位バイト計算結果による
 ;	繰り上がりや引き落としをPSL_Cに入るので上位バイトの計算に引き継がせる。
 ;	16ビット以上のローテート演算時も同様に、下位バイトのローテートで押し出されたビット内容が
 ;	PSL_Cに入るので、上位バイトのローテートに引き継がせる。
 ;
 ;PSL_OVF	EQU	00000100b
 ; オーバーフロー。演算結果が符号あり8ビット範囲超える=1。
 ;	符号あり8ビットで表現できる範囲は(-128...127)。
 ;	数値の範囲などオーバーフローしない設計にするのが基本。
 ;
 ;PSL_COM	EQU	00000010b
 ; 比較演算モード。0=算術演算、1=論理演算。
 ;	算術は値を符号あり8ビット(-128...127)で扱い、
 ;	論理は値を符号なし8ビット(0...255)で扱う。
 ;	PSL_COMにより、同じ「81h - 01h」の比較結果(PSL_CC)が
 ;	PSL_COM=0 なら「(-127) - (1)」= 80h(-128) で「lt」
 ;	PSL_COM=1 なら「 (129) - (1)」= 80h(128) で「gt」
 ;
 ;PSL_C	EQU	00000001b
 ; キャリー/ボロー。16ビット計算前に要設定。
 ;	加算前に要クリア、減算前に要セット。
 ;
;==========================================================
	LIST
 PSU_S	EQU	10000000b	; センス
 PSU_F	EQU	01000000b	; フラグ
 PSU_II	EQU	00100000b	; 割り込み禁止
 PSU_SP	EQU	00000111b	; スタックポインタ
 PSL_CC	EQU	11000000b	; コンディションコード
 PSL_IDC	EQU	00100000b	; インターデジットキャリー
 PSL_RS	EQU	00010000b	; レジスタバンクセレクト
 PSL_WC	EQU	00001000b	; ウィズキャリー
 PSL_OVF	EQU	00000100b	; オーバーフロー
 PSL_COM	EQU	00000010b	; 比較演算モード
 PSL_C	EQU	00000001b	; キャリー/ボロー

	NOLIST
;==========================================================
;キャラクタ定義領域
;==========================================================
	LIST
 CHR_SIZE	EQU	008h	; BG,SPR 一つ分の定義サイズ

	NOLIST
;==========================================================
;表示位置調整パラメータ
 ;今回の前提
 ;・高解像モードは使わない
 ;・スプライトと低解像モードBGの接触を計算で行いたい
 ;調整方針
 ;表示領域左上を（0,0）→右下を(7fh,67h)で調整。
;==========================================================
	LIST
 CRTCVPR_INIT	EQU	0f2h	; CRTCVPR:縦表示位置
 SPRITE_OFFS_X	EQU	02bh	; left side limit
 SPRITE_BASE_Y	EQU	0c0h	; 
 SPRITE_OFFS_Y	EQU	033h	; bottom line limit

	NOLIST
;==========================================================
; キー入力定義
 ;今回の前提
 ;・1P側、2P側を取得
 ;・PADは縦方向のみ
 ;・ONトリガを取得（OFFトリガ、押しっぱなしカウンタはなし）
;==========================================================
	LIST
 KEY_N	EQU	00000000b	; 方向キーニュートラル
 KEY_L	EQU	10000000b	; 左
 KEY_R	EQU	01000000b	; 右
 KEY_D	EQU	00100000b	; 下
 KEY_U	EQU	00010000b	; 上
 KEY_2	EQU	00001000b	; "2" ボタン
 KEY_5	EQU	00000100b	; "5" ボタン
 KEY_8	EQU	00000010b	; "8" ボタン
 KEY_0	EQU	00000001b	; "0" ボタン

 KEY_1	EQU	10000000b	; "1" ボタン
 KEY_4	EQU	01000000b	; "4" ボタン
 KEY_7	EQU	00100000b	; "7" ボタン
 KEY_E	EQU	00010000b	; "e" ボタン
 KEY_3	EQU	00001000b	; "3" ボタン
 KEY_6	EQU	00000100b	; "6" ボタン
 KEY_9	EQU	00000010b	; "9" ボタン
 KEY_C	EQU	00000001b	; "c" ボタン

	NOLIST
;==========================================================
; サウンド関連＆キャラモード＆水平方向スクロール定義
 ; PITCH 用
 ;  ACM_MASK bit  7     ; Alternate Character Mode
 ;   キャラモード設定（0 = ノーマル or 1 = ２ｘ２色）
 ;  PIT_MASK bits 6...0 ; pitch
 ;   音程設定領域
 ;
 ; VOLUMESCROLL 用
 ;  HSCR_MASK ;bits 7..5:
 ;   水平方向スクロール(0...7)
 ;  NOZ_MASK  ;bits 4   :
 ;   ノイズ設定
 ;  TON_MASK  ;bits 3   :
 ;   トーン設定
 ;  VOL_MASK  ;bits 2..0:
 ;   音量設定領域(0...7)
 ;
 ;  NOZ_ON ノイズON 設定値
 ;  TON_ON トーンON 設定値
;==========================================================
	LIST
 ACM_MASK	EQU	10000000b	; キャラモード
 PIT_MASK	EQU	01111111b	; 音程設定領域

 SCR_H_MASK	EQU	11100000b	; 水平方向スクロール(0...7)
 NOZ_MASK	EQU	00010000b	; ノイズ領域
 NOZ_ON	EQU	00010000b	; ノイズON
 TON_MASK	EQU	00001000b	; トーン領域
 TON_ON	EQU	00001000b	; トーンON
 VOL_MASK	EQU	00000111b	; 音量設定領域(0...7)

	end